HomuraVehicle/homuraLib_v2/machine/device/p32mx795f512h_defines.h
#ifndef P32MX79F512HDEFINES_INC
#define P32MX79F512HDEFINES_INC 100
#
#include"p32mx795f512h_forVC.h"
#define PORT_B
#define PORT_C
#define PORT_NO_C0
#define PORT_NO_C1
#define PORT_NO_C2
#define PORT_NO_C3
#define PORT_NO_C4
#define PORT_NO_C5
#define PORT_NO_C6
#define PORT_NO_C7
#define PORT_NO_C8
#define PORT_NO_C9
#define PORT_NO_C10
#define PORT_NO_C11
#define PORT_D
#define PORT_NO_D12
#define PORT_NO_D13
#define PORT_NO_D14
#define PORT_NO_D15
#define PORT_E
#define PORT_NO_E8
#define PORT_NO_E9
#define PORT_NO_E10
#define PORT_NO_E11
#define PORT_NO_E12
#define PORT_NO_E13
#define PORT_NO_E14
#define PORT_NO_E15
#define PORT_F
#define PORT_NO_F6
#define PORT_NO_F7
#define PORT_NO_F8
#define PORT_NO_F9
#define PORT_NO_F10
#define PORT_NO_F11
#define PORT_NO_F12
#define PORT_NO_F13
#define PORT_NO_F14
#define PORT_NO_F15
#define PORT_G
#define PORT_NO_G0
#define PORT_NO_G1
#define PORT_IN_G2
#define PORT_IN_G3
#define PORT_NO_G4
#define PORT_NO_G5
#define PORT_NO_G10
#define PORT_NO_G11
#define PORT_NO_G12
#define PORT_NO_G13
#define PORT_NO_G14
#define PORT_NO_G15

#
#endif
